src/test/java/kr/hhplus/be/server/load-test/jmeter/jmeter.log
2025-12-08 14:46:43,668 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2025-12-08 14:46:43,677 INFO o.a.j.JMeter: Loading user properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/user.properties
2025-12-08 14:46:43,677 INFO o.a.j.JMeter: Loading system properties from: /opt/homebrew/Cellar/jmeter/5.6.3/libexec/bin/system.properties
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: Copyright (c) 1998-2024 The Apache Software Foundation
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: Version 5.6.3
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: java.version=21.0.6
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: os.name=Mac OS X
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: os.arch=aarch64
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: os.version=15.6.1
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: file.encoding=UTF-8
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: java.awt.headless=true
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: Max memory     =1073741824
2025-12-08 14:46:43,679 INFO o.a.j.JMeter: Available Processors =8
2025-12-08 14:46:43,683 INFO o.a.j.JMeter: Default Locale=English (EN)
2025-12-08 14:46:43,683 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2025-12-08 14:46:43,683 INFO o.a.j.JMeter: JMeterHome=/opt/homebrew/Cellar/jmeter/5.6.3/libexec
2025-12-08 14:46:43,683 INFO o.a.j.JMeter: user.dir  =/Users/xaexix/Desktop/server-java/src/test/java/kr/hhplus/be/server/load-test/jmeter
2025-12-08 14:46:43,683 INFO o.a.j.JMeter: PWD       =/Users/xaexix/Desktop/server-java/src/test/java/kr/hhplus/be/server/load-test/jmeter
2025-12-08 14:46:43,684 INFO o.a.j.JMeter: IP: 127.0.0.1 Name: xaexix.local FullName: localhost
2025-12-08 14:46:43,689 INFO o.a.j.s.FileServer: Default base='/Users/xaexix/Desktop/server-java/src/test/java/kr/hhplus/be/server/load-test/jmeter'
2025-12-08 14:46:43,690 INFO o.a.j.s.FileServer: Set new base='/Users/xaexix/Desktop/server-java/src/test/java/kr/hhplus/be/server/load-test/jmeter'
2025-12-08 14:46:43,763 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2025-12-08 14:46:43,784 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2025-12-08 14:46:43,785 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2025-12-08 14:46:43,786 INFO o.a.j.s.SaveService: Loading file: e2e-flow-test.jmx
2025-12-08 14:46:43,816 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-08 14:46:43,816 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-08 14:46:43,816 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-08 14:46:43,816 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2025-12-08 14:46:43,816 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2025-12-08 14:46:43,816 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2025-12-08 14:46:43,824 INFO o.a.j.JMeter: Creating summariser <summary>
2025-12-08 14:46:43,830 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2025-12-08 14:46:43,830 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-08 14:46:43,830 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2025-12-08 14:46:43,832 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2025-12-08 14:46:43,832 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2025-12-08 14:46:43,855 INFO o.a.j.r.ClassFinder: Will scan jar /opt/homebrew/Cellar/jmeter/5.6.3/libexec/lib/ext/jmeter-plugins-manager-1.9.jar with filter ExtendsClassFilter [parents=[interface org.apache.jmeter.functions.Function], inner=false, contains=null, notContains=null]. Consider exposing JMeter plugins via META-INF/services, and add JMeter-Skip-Class-Scanning=true manifest attribute so JMeter can skip classfile scanning
2025-12-08 14:46:43,889 INFO o.a.j.JMeter: Running test (1765172803889)
2025-12-08 14:46:43,897 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : E2E Users
2025-12-08 14:46:43,897 INFO o.a.j.e.StandardJMeterEngine: Starting 50 threads for group E2E Users.
2025-12-08 14:46:43,897 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2025-12-08 14:46:43,897 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=50 ramp-up=5 delayedStart=false
2025-12-08 14:46:43,900 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-1
2025-12-08 14:46:43,907 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2025-12-08 14:46:43,907 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2025-12-08 14:46:43,909 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = xaexix.local
2025-12-08 14:46:43,911 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2025-12-08 14:46:43,911 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2025-12-08 14:46:43,911 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to UTF-8
2025-12-08 14:46:43,911 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2025-12-08 14:46:43,911 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2025-12-08 14:46:43,999 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-2
2025-12-08 14:46:44,015 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-1
2025-12-08 14:46:44,015 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-1
2025-12-08 14:46:44,040 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-2
2025-12-08 14:46:44,041 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-2
2025-12-08 14:46:44,104 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-3
2025-12-08 14:46:44,199 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-4
2025-12-08 14:46:44,202 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-3
2025-12-08 14:46:44,202 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-3
2025-12-08 14:46:44,299 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-4
2025-12-08 14:46:44,299 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-5
2025-12-08 14:46:44,299 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-4
2025-12-08 14:46:44,402 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-6
2025-12-08 14:46:44,404 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-5
2025-12-08 14:46:44,404 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-5
2025-12-08 14:46:44,435 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-6
2025-12-08 14:46:44,435 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-6
2025-12-08 14:46:44,499 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-7
2025-12-08 14:46:44,523 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-7
2025-12-08 14:46:44,523 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-7
2025-12-08 14:46:44,599 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-8
2025-12-08 14:46:44,624 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-8
2025-12-08 14:46:44,624 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-8
2025-12-08 14:46:44,702 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-9
2025-12-08 14:46:44,729 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-9
2025-12-08 14:46:44,729 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-9
2025-12-08 14:46:44,799 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-10
2025-12-08 14:46:44,826 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-10
2025-12-08 14:46:44,826 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-10
2025-12-08 14:46:44,900 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-11
2025-12-08 14:46:44,926 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-11
2025-12-08 14:46:44,926 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-11
2025-12-08 14:46:45,003 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-12
2025-12-08 14:46:45,036 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-12
2025-12-08 14:46:45,036 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-12
2025-12-08 14:46:45,102 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-13
2025-12-08 14:46:45,125 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-13
2025-12-08 14:46:45,125 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-13
2025-12-08 14:46:45,199 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-14
2025-12-08 14:46:45,222 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-14
2025-12-08 14:46:45,222 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-14
2025-12-08 14:46:45,299 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-15
2025-12-08 14:46:45,327 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-15
2025-12-08 14:46:45,327 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-15
2025-12-08 14:46:45,398 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-16
2025-12-08 14:46:45,422 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-16
2025-12-08 14:46:45,422 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-16
2025-12-08 14:46:45,502 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-17
2025-12-08 14:46:45,526 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-17
2025-12-08 14:46:45,526 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-17
2025-12-08 14:46:45,603 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-18
2025-12-08 14:46:45,628 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-18
2025-12-08 14:46:45,628 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-18
2025-12-08 14:46:45,702 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-19
2025-12-08 14:46:45,728 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-19
2025-12-08 14:46:45,728 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-19
2025-12-08 14:46:45,802 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-20
2025-12-08 14:46:45,827 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-20
2025-12-08 14:46:45,827 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-20
2025-12-08 14:46:45,902 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-21
2025-12-08 14:46:45,924 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-21
2025-12-08 14:46:45,924 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-21
2025-12-08 14:46:45,998 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-22
2025-12-08 14:46:46,021 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-22
2025-12-08 14:46:46,021 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-22
2025-12-08 14:46:46,102 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-23
2025-12-08 14:46:46,128 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-23
2025-12-08 14:46:46,128 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-23
2025-12-08 14:46:46,202 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-24
2025-12-08 14:46:46,227 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-24
2025-12-08 14:46:46,228 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-24
2025-12-08 14:46:46,299 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-25
2025-12-08 14:46:46,328 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-25
2025-12-08 14:46:46,328 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-25
2025-12-08 14:46:46,401 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-26
2025-12-08 14:46:46,432 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-26
2025-12-08 14:46:46,432 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-26
2025-12-08 14:46:46,498 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-27
2025-12-08 14:46:46,523 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-27
2025-12-08 14:46:46,523 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-27
2025-12-08 14:46:46,603 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-28
2025-12-08 14:46:46,625 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-28
2025-12-08 14:46:46,625 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-28
2025-12-08 14:46:46,702 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-29
2025-12-08 14:46:46,735 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-29
2025-12-08 14:46:46,735 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-29
2025-12-08 14:46:46,801 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-30
2025-12-08 14:46:46,830 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-30
2025-12-08 14:46:46,830 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-30
2025-12-08 14:46:46,902 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-31
2025-12-08 14:46:46,925 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-31
2025-12-08 14:46:46,925 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-31
2025-12-08 14:46:47,002 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-32
2025-12-08 14:46:47,028 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-32
2025-12-08 14:46:47,028 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-32
2025-12-08 14:46:47,102 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-33
2025-12-08 14:46:47,132 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-33
2025-12-08 14:46:47,132 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-33
2025-12-08 14:46:47,202 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-34
2025-12-08 14:46:47,226 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-34
2025-12-08 14:46:47,226 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-34
2025-12-08 14:46:47,302 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-35
2025-12-08 14:46:47,324 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-35
2025-12-08 14:46:47,325 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-35
2025-12-08 14:46:47,403 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-36
2025-12-08 14:46:47,431 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-36
2025-12-08 14:46:47,431 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-36
2025-12-08 14:46:47,502 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-37
2025-12-08 14:46:47,534 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-37
2025-12-08 14:46:47,534 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-37
2025-12-08 14:46:47,603 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-38
2025-12-08 14:46:47,630 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-38
2025-12-08 14:46:47,630 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-38
2025-12-08 14:46:47,702 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-39
2025-12-08 14:46:47,731 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-39
2025-12-08 14:46:47,731 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-39
2025-12-08 14:46:47,799 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-40
2025-12-08 14:46:47,827 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-40
2025-12-08 14:46:47,827 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-40
2025-12-08 14:46:47,902 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-41
2025-12-08 14:46:47,928 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-41
2025-12-08 14:46:47,928 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-41
2025-12-08 14:46:47,999 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-42
2025-12-08 14:46:48,023 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-42
2025-12-08 14:46:48,024 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-42
2025-12-08 14:46:48,100 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-43
2025-12-08 14:46:48,133 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-43
2025-12-08 14:46:48,134 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-43
2025-12-08 14:46:48,203 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-44
2025-12-08 14:46:48,226 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-44
2025-12-08 14:46:48,226 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-44
2025-12-08 14:46:48,303 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-45
2025-12-08 14:46:48,328 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-45
2025-12-08 14:46:48,329 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-45
2025-12-08 14:46:48,403 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-46
2025-12-08 14:46:48,434 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-46
2025-12-08 14:46:48,434 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-46
2025-12-08 14:46:48,498 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-47
2025-12-08 14:46:48,522 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-47
2025-12-08 14:46:48,522 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-47
2025-12-08 14:46:48,597 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-48
2025-12-08 14:46:48,627 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-48
2025-12-08 14:46:48,627 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-48
2025-12-08 14:46:48,701 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-49
2025-12-08 14:46:48,728 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-49
2025-12-08 14:46:48,729 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-49
2025-12-08 14:46:48,801 INFO o.a.j.t.JMeterThread: Thread started: E2E Users 1-50
2025-12-08 14:46:48,825 INFO o.a.j.t.JMeterThread: Thread is done: E2E Users 1-50
2025-12-08 14:46:48,825 INFO o.a.j.t.JMeterThread: Thread finished: E2E Users 1-50
2025-12-08 14:46:48,826 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2025-12-08 14:46:48,827 INFO o.a.j.r.Summariser: summary =    150 in 00:00:05 =   30.4/s Avg:     9 Min:     4 Max:    80 Err:     0 (0.00%)